---
kind: property
id: P:Autodesk.Revit.DB.ColorFillScheme.StorageType
source: html/41c8e61c-fa40-0d69-9c5c-d955baaddbf5.htm
---
# Autodesk.Revit.DB.ColorFillScheme.StorageType Property

Represents the type of parameter values stored in entries.

## Syntax (C#)
```csharp
public StorageType StorageType { get; }
```